#### Import Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
city_data = {
"City": ["New York City", "Paris", "Barcelona", "Rome"],
"Country": ["United States", "France", "Spain", "Italy"],
"Population": [8600000, 2141000, 5515000, 2873000]
}

In [3]:
# create a DataFrame from a dictionary
city_df = pd.DataFrame(city_data)
city_df

            City        Country  Population
0  New York City  United States     8600000
1          Paris         France     2141000
2      Barcelona          Spain     5515000
3           Rome          Italy     2873000

**Transpose data**

In [4]:
city_df.transpose()

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

In [5]:
# the same result using the .T attribute
city_df.T

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

#### Creating a DataFrame from a NumPy ndarray

In [6]:
random_data = np.random.randint(1, 101, size=(3, 5))
random_data

array([[54, 60, 46, 11, 26],
       [67, 39, 37, 21, 86],
       [63, 39, 90, 19, 18]])

In [7]:
pd.DataFrame(data=random_data)

    0   1   2   3   4
0  54  60  46  11  26
1  67  39  37  21  86
2  63  39  90  19  18

**Create a dataframe manualy**

In [8]:
row_labels = ["Morning", "Afternoon", "Evening"]
temperatures = pd.DataFrame(data = random_data, index = row_labels)
temperatures

            0   1   2   3   4
Morning    54  60  46  11  26
Afternoon  67  39  37  21  86
Evening    63  39  90  19  18

In [9]:
row_labels = ["Morning", "Afternoon", "Evening"]
column_labels = (
"Monday",
"Tuesday",
"Wednesday",
"Thursday",
"Friday",
)

In [10]:
pd.DataFrame(data=random_data, index = row_labels,columns = column_labels)

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning        54       60         46        11      26
Afternoon      67       39         37        21      86
Evening        63       39         90        19      18

**The Dataframe allows to have duplicates in the index and rows**

In [11]:
# Morning and Tuesday are duplicated
row_labels = ["Morning", "Afternoon", "Morning"]
column_lables_1 = [
    "Monday",
    "Tuesday",
    "Tuesday",
    "Tuesday",
    "Friday"
]

df_Tuesday = pd.DataFrame(
    data = random_data,
    index = row_labels,
    columns = column_lables_1
)

**Bad practise**

In [12]:
df_Tuesday['Tuesday']

           Tuesday  Tuesday  Tuesday
Morning         60       46       11
Afternoon       39       37       21
Morning         39       90       19

#### Import data with CSV

In [13]:
nba_path = '/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 4 Dataframe/Data/nba.csv'

In [36]:
df_nba = pd.read_csv(nba_path, parse_dates=['Birthday'])

/var/folders/pg/x6kyk1l92fj8q4332g1j8rnw0000gp/T/ipykernel_25017/369267196.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_nba = pd.read_csv(nba_path, parse_dates=['Birthday'])

**Alternative way to parse date in the Dataframe**

In [15]:
df_nba = pd.read_csv(nba_path)
df_nba['Birthday'] = pd.to_datetime(df_nba['Birthday'], format='%m/%d/%y')
# change the date format to 'YYYY-MM-DD'
df_nba['Birthday'] = df_nba['Birthday'].dt.strftime('%Y-%m-%d')

In [16]:
df_nba.shape

(450, 5)

In [17]:
type(df_nba)

pandas.core.frame.DataFrame

In [18]:
df_nba.head()

             Name                Team Position    Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG  1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF  1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF  1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG  1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G  1995-07-26    79568

#### Shared and Exclusive Attributes between Series and DataFrames

In [19]:
# check the data types of each column
df_nba.dtypes

Name        object
Team        object
Position    object
Birthday    object
Salary       int64
dtype: object

In [20]:
# Count values for each data type
df_nba.dtypes.value_counts()

object    4
int64     1
Name: count, dtype: int64

In [21]:
# View the index
df_nba.index

RangeIndex(start=0, stop=450, step=1)

In [22]:
# View the columns
df_nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [23]:
# method ndim shows the number of dimensions of the DataFrame = 2 and Series = 1
df_nba.ndim

2

In [24]:
# method shape shows the number of rows and columns
df_nba.shape

(450, 5)

In [25]:
# method size shows the number of elements in the DataFrame
df_nba.size

2250

In [26]:
# method count shows the number of non-null values in each column
df_nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

#### Shared Methods between Series and DataFrames

In [27]:
df_nba.head()

             Name                Team Position    Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG  1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF  1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF  1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG  1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G  1995-07-26    79568

In [28]:
df_nba.tail()

              Name                 Team Position    Birthday    Salary
445  Austin Rivers      Houston Rockets       PG  1992-08-01   2174310
446    Harry Giles     Sacramento Kings       PF  1998-04-22   2578800
447    Robin Lopez      Milwaukee Bucks        C  1988-04-01   4767000
448  Collin Sexton  Cleveland Cavaliers       PG  1999-01-04   4764960
449    Ricky Rubio         Phoenix Suns       PG  1990-10-21  16200000

In [29]:
# method sample shows random rows from the DataFrame
df_nba.sample(5)

                Name                    Team Position    Birthday    Salary
279   Henry Ellenson           Brooklyn Nets       PF  1997-01-13     79568
177  Harrison Barnes        Sacramento Kings       PF  1992-05-30  24147727
84      John Collins           Atlanta Hawks       PF  1997-09-23   2686560
212      Rodney Hood  Portland Trail Blazers       SF  1992-10-20   5718000
169  Emmanuel Mudiay               Utah Jazz       PG  1996-03-05   1737145

In [30]:
# method nunique shows the number of unique values in each column
df_nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [31]:
# method max shows the maximum value in each column. It's not one row with maximum values
df_nba.max()

Name            Zylan Cheatham
Team        Washington Wizards
Position                    SG
Birthday            2000-12-23
Salary                40231758
dtype: object

In [32]:
df_nba[df_nba['Name'] == 'Zylan Cheatham']

               Name                  Team Position    Birthday  Salary
248  Zylan Cheatham  New Orleans Pelicans       SF  1995-11-17   79568

In [33]:
# method min shows the minimum value in each column. It's not one row with minimum values
df_nba.min()

Name         Aaron Gordon
Team        Atlanta Hawks
Position                C
Birthday       1977-01-26
Salary              79568
dtype: object

In [34]:
# method nlargest shows the n largest values in a column
df_nba.nlargest(n=4, columns='Salary')

                  Name                   Team Position    Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG  1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG  1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG  1988-11-12  38506482
251          John Wall     Washington Wizards       PG  1990-09-06  38199000

In [37]:
# method nsmallest shows the n smallest values in a column
df_nba.nsmallest(n=4, columns='Birthday')

               Name             Team Position   Birthday   Salary
98     Vince Carter    Atlanta Hawks       PF 1977-01-26  2564753
196   Udonis Haslem       Miami Heat        C 1980-06-09  2564753
262     Kyle Korver  Milwaukee Bucks       PF 1981-03-17  6004753
149  Tyson Chandler  Houston Rockets        C 1982-10-02  2564753

**Find the salary sum**

In [38]:
# numeric_only parameter returns only numeric columns
df_nba.sum(numeric_only=True)

Salary    3444112694
dtype: int64

**Average salary in the NBA**

In [39]:
# method mean shows the mean value in each numeric column
df_nba.mean(numeric_only=True).round(2)

Salary    7653583.76
dtype: float64

In [40]:
# method median shows the median value in each numeric column
df_nba.median(numeric_only=True).round(2)

Salary    3303074.5
dtype: float64

In [41]:
# method mode shows the most frequently occurring value in each column
df_nba.mode(numeric_only=True)

   Salary
0   79568

In [42]:
# method std shows the standard deviation in each numeric column
df_nba.std(numeric_only=True).round(2)

Salary    9288810.3
dtype: float64

#### Sorting a DataFrame

In [43]:
# Sorting by a single column
df_nba.sort_values(by='Salary', ascending=False).head()

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000
264       James Harden        Houston Rockets       PG 1989-08-26  38199000

In [44]:
# Same result using the .sort_index() method    
df_nba.sort_values('Name').head()

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000

**Sorting by few columns**

In [45]:
# using different sorting orders for multiple columns ascending=[True, False]
df_nba.sort_values(by=['Team', 'Salary'], ascending=[True, False]).head()

                 Name           Team Position   Birthday    Salary
111  Chandler Parsons  Atlanta Hawks       SF 1988-10-25  25102512
28        Evan Turner  Atlanta Hawks       PG 1988-10-27  18606556
167      Allen Crabbe  Atlanta Hawks       SG 1992-04-09  18500000
213   De'Andre Hunter  Atlanta Hawks       SF 1997-12-02   7068360
339     Jabari Parker  Atlanta Hawks       PF 1995-03-15   6500000

**Sorting by index**

In [46]:
df_nba.sort_index(ascending=True).head()

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G 1995-07-26    79568

In [47]:
# Last row in the DataFrame will be the first one
df_nba.sort_index(ascending=False).head()

              Name                 Team Position   Birthday    Salary
449    Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000
448  Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
447    Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
446    Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
445  Austin Rivers      Houston Rockets       PG 1992-08-01   2174310

**Sorting by Column Index**

In [48]:

df_nba.sort_index(axis='columns').head()

    Birthday            Name Position   Salary                Team
0 1996-09-26    Shake Milton       SG  1445697  Philadelphia 76ers
1 1995-09-27  Christian Wood       PF  1645357     Detroit Pistons
2 1998-08-23   PJ Washington       PF  3831840   Charlotte Hornets
3 1988-10-04    Derrick Rose       PG  7317074     Detroit Pistons
4 1995-07-26   Marial Shayok        G    79568  Philadelphia 76ers

In [49]:
df_nba.sort_index(axis=1).head()

    Birthday            Name Position   Salary                Team
0 1996-09-26    Shake Milton       SG  1445697  Philadelphia 76ers
1 1995-09-27  Christian Wood       PF  1645357     Detroit Pistons
2 1998-08-23   PJ Washington       PF  3831840   Charlotte Hornets
3 1988-10-04    Derrick Rose       PG  7317074     Detroit Pistons
4 1995-07-26   Marial Shayok        G    79568  Philadelphia 76ers

In [50]:
# change the order of columns in the DataFrame using column index
df_nba.sort_index(axis='columns', ascending=False).head()

                 Team   Salary Position            Name   Birthday
0  Philadelphia 76ers  1445697       SG    Shake Milton 1996-09-26
1     Detroit Pistons  1645357       PF  Christian Wood 1995-09-27
2   Charlotte Hornets  3831840       PF   PJ Washington 1998-08-23
3     Detroit Pistons  7317074       PG    Derrick Rose 1988-10-04
4  Philadelphia 76ers    79568        G   Marial Shayok 1995-07-26

#### Setting a New Index

In [51]:
# Set 'Name' column as the index
df_nba.set_index('Name').head()

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

In [52]:
#the same result using the .set_index() method
df_nba = df_nba.set_index(keys='Name')
df_nba.head()

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

In [ ]:
# If the column became the index, it disappears from the columns
# If you want to reset the index to the default integer index, you can use the .reset_index() method
df_nba = df_nba.reset_index()

#### Selecting Columns and Rows from a DataFrame

##### Selecting a Single Column from a DataFrame

In [54]:
# select a single column using the column name via dot notation
df_nba.Salary

Name
Shake Milton       1445697
Christian Wood     1645357
PJ Washington      3831840
Derrick Rose       7317074
Marial Shayok        79568
                    ...
Austin Rivers      2174310
Harry Giles        2578800
Robin Lopez        4767000
Collin Sexton      4764960
Ricky Rubio       16200000
Name: Salary, Length: 450, dtype: int64

In [55]:
# select a single column using the column name via bracket notation
df_nba['Team']

Name
Shake Milton       Philadelphia 76ers
Christian Wood        Detroit Pistons
PJ Washington       Charlotte Hornets
Derrick Rose          Detroit Pistons
Marial Shayok      Philadelphia 76ers
                         ...
Austin Rivers         Houston Rockets
Harry Giles          Sacramento Kings
Robin Lopez           Milwaukee Bucks
Collin Sexton     Cleveland Cavaliers
Ricky Rubio              Phoenix Suns
Name: Team, Length: 450, dtype: object

##### Selecting a multiple Column from a DataFrame

In [56]:
# select multiple columns using a list of column names
df_nba[['Team','Position']]

                               Team Position
Name
Shake Milton     Philadelphia 76ers       SG
Christian Wood      Detroit Pistons       PF
PJ Washington     Charlotte Hornets       PF
Derrick Rose        Detroit Pistons       PG
Marial Shayok    Philadelphia 76ers        G
...                             ...      ...
Austin Rivers       Houston Rockets       PG
Harry Giles        Sacramento Kings       PF
Robin Lopez         Milwaukee Bucks        C
Collin Sexton   Cleveland Cavaliers       PG
Ricky Rubio            Phoenix Suns       PG

[450 rows x 2 columns]

##### Selecting a column by data type

In [57]:
# Select all columns of a specific data type include=['object']
df_nba.select_dtypes(include=['object']).head()

                              Team Position
Name
Shake Milton    Philadelphia 76ers       SG
Christian Wood     Detroit Pistons       PF
PJ Washington    Charlotte Hornets       PF
Derrick Rose       Detroit Pistons       PG
Marial Shayok   Philadelphia 76ers        G

In [58]:
# Select all columns except specific data types exclude=['object','int64']
df_nba.select_dtypes(exclude=['object','int64']).head()

                 Birthday
Name
Shake Milton   1996-09-26
Christian Wood 1995-09-27
PJ Washington  1998-08-23
Derrick Rose   1988-10-04
Marial Shayok  1995-07-26

#### Selecting Rows from a DataFrame

##### Extracting Rows by Index Label

In [60]:
df_nba.loc["LeBron James"]

Team         Los Angeles Lakers
Position                     PF
Birthday    1984-12-30 00:00:00
Salary                 37436858
Name: LeBron James, dtype: object

In [63]:
df_nba.loc[["Kawhi Leonard", "Paul George"]]

                               Team Position   Birthday    Salary
Name
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000
Paul George    Los Angeles Clippers       SF 1990-05-02  33005556

In [64]:
df_nba.sort_index().loc["Otto Porter":"Patrick Beverley"]

                                  Team Position   Birthday    Salary
Name
Otto Porter              Chicago Bulls       SF 1993-06-03  27250576
PJ Dozier               Denver Nuggets       PG 1996-10-25     79568
PJ Washington        Charlotte Hornets       PF 1998-08-23   3831840
Pascal Siakam          Toronto Raptors       PF 1994-04-02   2351838
Pat Connaughton        Milwaukee Bucks       SG 1993-01-06   1723050
Patrick Beverley  Los Angeles Clippers       PG 1988-07-12  12345680

In [65]:
df_nba.sort_index().loc["Zach Collins":]

                                   Team Position   Birthday    Salary
Name
Zach Collins     Portland Trail Blazers        C 1997-11-19   4240200
Zach LaVine               Chicago Bulls       PG 1995-03-10  19500000
Zach Norvell         Los Angeles Lakers       SG 1997-12-09     79568
Zhaire Smith         Philadelphia 76ers       SG 1999-06-04   3058800
Zion Williamson    New Orleans Pelicans        F 2000-07-06   9757440
Zylan Cheatham     New Orleans Pelicans       SF 1995-11-17     79568

In [66]:
df_nba.sort_index().loc[:"Al Horford"]

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
Al Horford            Philadelphia 76ers        C 1986-06-03  28000000